src/cf/Documents/КлючевыеЗадачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>КлючевыеЗадачи</Name>
			<BasedOn>
				<xr:Item>Catalog.Этапы</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Название</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Этапы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Этап</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Этапы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеЭтапа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Цели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цвет</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Картинка</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаследоватьЦветЦели</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Enums/СтатусыЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>СтатусыЗадач</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Плавающая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запланированная</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/КлючевыеЗадачи/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура СтнадартнаяДатаПриИзменении(Элемент)	
	Объект.Дата = СтандартнаяДатаНачала.Дата;	
	//Если Не ЗначениеЗаполнено(СтандартнаяДатаОкончания.Дата)  Тогда	
		ДатаОкончания = Объект.Дата + 60*60;
		СтандартнаяДатаОкончания.Дата = ДатаОкончания;
		Объект.ДатаОкончания = ДатаОкончания; //+1 ЧАС	
	//КонецЕсли; 
	

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Не ЗначениеЗаполнено(Объект.Ссылка)  Тогда
		
		  СтандартнаяДатаНачала.Дата = ТекущаяДата();
		  СтандартнаяДатаОкончания.Дата = СтандартнаяДатаОкончания.Дата + 60*60;
	  КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если СтандартнаяДатаОкончания.Дата <= СтандартнаяДатаНачала.Дата  Тогда
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Дата окончания задачи не может быть меньше даты начала задачи!";
		Сообщение.Поле = "СтандартнаяДатаОкончания";
		Сообщение.УстановитьДанные(СтандартнаяДатаОкончания);
		Сообщение.Сообщить();	
	КонецЕсли;
	
	Если ПустаяСтрока(Объект.Название) Тогда
		Объект.Название = Строка(Объект.Этап);	
	КонецЕсли;
	
	ТекущийОбъект.Дата = СтандартнаяДатаНачала.Дата;
	ТекущийОбъект.ДатаОкончания = СтандартнаяДатаОкончания.Дата;
	ТекущийОбъект.Цвет = Новый ХранилищеЗначения(ЦветЗадачиВПланировщике);
	

КонецПроцедуры


&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ЦветЗадачиВПланировщике = ТекущийОбъект.Цвет.Получить();
	СтандартнаяДатаНачала.Дата = ТекущийОбъект.Дата;	
	СтандартнаяДатаОкончания.Дата = ТекущийОбъект.ДатаОкончания;
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.Ссылка) И  ЗначениеЗаполнено(Объект.Цель) Тогда
		ЦветЦели = Объект.Цель.Цвет.Получить();
		//Объект.Цвет = ЦветЦели;
		ЦветЗадачиВПланировщике = ЦветЦели;
		Объект.НаследоватьЦветЦели = Истина;
		Элементы.ЦветЗадачиВПланировщике.Доступность = Ложь;		
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Цель)  Тогда
		Элементы.Цель.Вид = ВидПоляФормы.ПолеВвода;
		Элементы.Цель.Доступность = Истина;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ДатаОкончания) И НЕ Объект.Дата = НачалоДня(Объект.ДатаОкончания) Тогда		
		Объект.Статус = Перечисления.СтатусыЗадач.Плавающая;
	Иначе 
		ОБъект.Статус = Перечисления.СтатусыЗадач.Запланированная;
	КонецЕсли;
	
	
КонецПроцедуры


&НаКлиенте
Процедура НаследоватьОтЦелиПриИзменении(Элемент)
	Элементы.ЦветЗадачиВПланировщике.Доступность = Не Объект.НаследоватьЦветЦели;
	Если ЗначениеЗаполнено(Объект.Цель)  Тогда		
		ЦветЗадачиВПланировщике = ПолучитьЦветЦелиНаСервере();				
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Функция ПолучитьЦветЦелиНаСервере()
Возврат	Объект.Цель.Цвет.Получить();
	
КонецФункции // ()

&НаКлиенте
Процедура НазваниеШагаНажатие(Элемент, СтандартнаяОбработка)
	//Элемент.
КонецПроцедуры

&НаКлиенте
Процедура ЦельНажатие(Элемент, СтандартнаяОбработка)
	ыва = 1;
КонецПроцедуры

&НаСервере
Процедура СтандартнаяДатаОкончанияПриИзмененииНаСервере(ДатаНачала, ДатаОкончания)
	Если ДатаОкончания = НачалоДня(ДатаОкончания) ИЛИ ДатаОкончания = КонецДня(ДатаОкончания)Тогда
		Объект.Статус = Перечисления.СтатусыЗадач.Плавающая;
	Иначе
		Объект.Статус = Перечисления.СтатусыЗадач.Запланированная;
	КонецЕсли;
	
	Если ДатаОкончания < ДатаНачала  Тогда
		
		Объект.Дата = НачалоДня(Объект.Дата);		
		СтандартнаяДатаНачала.Дата = Объект.Дата;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтандартнаяДатаОкончанияПриИзменении(Элемент)
	Попытка	
			СтандартнаяДатаОкончанияПриИзмененииНаСервере(Дата(Элементы.СтнадартнаяДатаНачала.ТекстРедактирования), Дата(Элемент.ТекстРедактирования));
	
	Исключение
	
	КонецПопытки;
КонецПроцедуры
